<a href="https://colab.research.google.com/github/SONYOUNGSOO/PythonTest/blob/main/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#1. Mount Drive

In [1]:
from google.colab import drive
drive.mount('/gdrive')

Drive already mounted at /gdrive; to attempt to forcibly remount, call drive.mount("/gdrive", force_remount=True).

In [2]:
!ls -al '/gdrive/My Drive/data'

total 2169852
-rw------- 1 root root     52512 Feb  1 01:51 ETC_75_04_01_580736.csv
-rw------- 1 root root 738556069 Apr  1  2020 TCS_11_03_02_377727.csv
-rw------- 1 root root 699429059 Mar  1  2020 TCS_11_03_02_447126.csv
-rw------- 1 root root 783889122 Feb  1  2020 TCS_11_03_02_598345.csv

#2. Load Data

In [3]:
import pandas as pd

In [4]:
#Load a file under "data" folder
file = "/gdrive/My Drive/data/TCS_11_03_02_598345.csv"
data = pd.read_csv(file, sep=",",encoding="euc-kr")

In [5]:
data.head()

       집계일자  집계시  출발영업소코드  도착영업소코드  TCS차종구분코드  통행시간  Unnamed: 6
0  20200101   17        0      101          3    -1         NaN
1  20200101   17        0      101          1    -1         NaN
2  20200101    9        0      101          2    -1         NaN
3  20200101    9        0      101          1    -1         NaN
4  20200101    7        0      101          1    -1         NaN

In [6]:
data.head(10)

       집계일자  집계시  출발영업소코드  도착영업소코드  TCS차종구분코드  통행시간  Unnamed: 6
0  20200101   17        0      101          3    -1         NaN
1  20200101   17        0      101          1    -1         NaN
2  20200101    9        0      101          2    -1         NaN
3  20200101    9        0      101          1    -1         NaN
4  20200101    7        0      101          1    -1         NaN
5  20200101    9        0      101          3    -1         NaN
6  20200101    6        0      101          1    -1         NaN
7  20200101    6        0      101          3    -1         NaN
8  20200101    7        0      101          3    -1         NaN
9  20200101   19        0      101          1    -1         NaN

In [7]:
data.tail()

              집계일자  집계시  출발영업소코드  도착영업소코드  TCS차종구분코드   통행시간  Unnamed: 6
25596211  20200131    9      272      641          1   8388         NaN
25596212  20200131   15      137      245          3   2341         NaN
25596213  20200131    6      127      612          5  42535         NaN
25596214  20200131    6      671      127          1   9494         NaN
25596215  20200131   17      212      253          3    833         NaN

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25596216 entries, 0 to 25596215
Data columns (total 7 columns):
 #   Column      Dtype
---  ------      -----
 0   집계일자        int64
 1   집계시         int64
 2   출발영업소코드     int64
 3   도착영업소코드     int64
 4   TCS차종구분코드   int64
 5   통행시간        int64
 6   Unnamed: 6  float64
dtypes: float64(1), int64(6)
memory usage: 1.3 GB

#3.Clean Data

In [6]:
#Checking null value
data.isnull().sum(axis=0)

집계일자                 0
집계시                  0
출발영업소코드              0
도착영업소코드              0
TCS차종구분코드            0
통행시간                 0
Unnamed: 6    25596216
dtype: int64

In [7]:
#show columns of the dta frame
data.columns

Index(['집계일자', '집계시', '출발영업소코드', '도착영업소코드', 'TCS차종구분코드', '통행시간', 'Unnamed: 6'], dtype='object')

In [8]:
data.columns[1]

'집계시'

In [10]:
#drop smoe columns with null values
data_clean = data.drop(['Unnamed: 6'],axis ='columns')

In [11]:
data_clean.head()

       집계일자  집계시  출발영업소코드  도착영업소코드  TCS차종구분코드  통행시간
0  20200101   17        0      101          3    -1
1  20200101   17        0      101          1    -1
2  20200101    9        0      101          2    -1
3  20200101    9        0      101          1    -1
4  20200101    7        0      101          1    -1

In [13]:
(data_clean.통행시간 > 0).unique()

array([False,  True])

In [12]:
data_clean.통행시간 > 0

0           False
1           False
2           False
3           False
4           False
            ...
25596211     True
25596212     True
25596213     True
25596214     True
25596215     True
Name: 통행시간, Length: 25596216, dtype: bool

In [14]:
data_clean = data_clean[data_clean.통행시간 > 0]

In [15]:
data_clean.head()

          집계일자  집계시  출발영업소코드  도착영업소코드  TCS차종구분코드  통행시간
5853  20200101   22      101      102          6   632
5854  20200101   22      101      102          3   633
5855  20200101   16      101      102          6   650
5856  20200101   16      101      102          1   623
5857  20200101   16      101      102          3   626